app/controllers/books_controller.rb

  def index
    Book.reindex
    if params[:query].present?
      @books = Book.search(params[:query], fields: [:title, :author, :searchable_text], match: :word_middle, page: params[:page])
---
SELECT  "books".* FROM "books" WHERE "books"."text" = $1 LIMIT $2  [["text", "the raven"], ["LIMIT", 11]]